import re
myStr = """
124528	男	14年	2012年5月以前	路人(0)	2017/02/21
2
顺便签约客服
940064306	男	9年	2016/07/12	宗师(1285)	2017/06/26
3
世间尽是妖魔鬼怪"(oДo*)
90年代的新一辈_
1193887909	男	7年	2016/10/17	宗师(1084)	2017/06/26
4
萧十三楼
905519160	男	9年	2016/07/08	宗师(972)	2017/06/24
5
石头哥
北京-php-石头
2669288101	男	2年	2016/06/17	宗师(772)	2017/06/23
6
       缄默。
1393144035	未知	7年	2016/10/08	宗师(754)	2017/06/25
"""
#1 匹配所有正常的年  7年  9年
#匹配出 2016/06/17格式的年月日
res = re.findall("\t(\d{1,2}年)",myStr)
# res = re.findall("[0-9]{4}/[0-9]{2}/[0-9]{2}",myStr)
# res = re.findall("\d{4}/\d{2}/\d{2}",myStr)

print(res)
