# s1 = '我是一个字符串'
# s2 = "我也是一个字符串"
# s3 = """我依然是一个字符串"""
# s4 = '''我还是一个字符串'''
#
# # 想打印以下内容
# # 周杰伦说:"我要'上天'!!!"
# print("周杰伦说:\"我要上天!!!\"")  # 别的语言
# print('周杰伦说:"我要上天!!!"')
# print("""周杰伦说:"我要'上天'!!!" """)


# 索引和切片
# 字符串的概念: 把字符连成串
#    01234
# s = "alex昨天晚上喝多了. 被抓了. 不知道为什么"

# # # 索引就是第n个字符, 索引是从0开始的
# # s1 = s[0]  # a
# # print(s1)
# # print(s[5])
#
# # 切片  可以从字符串中复制一段子字符串
# print(s[0: 4])  # 记住了. 这里切片顾头不顾尾
#
# # python的索引, 可以从后往前拿
# print(s[-1])  # 直接拿最后一项内容

# s = "呆你这泼猴"
# print(s[1:])

#

# # 从网页上提取内容
# s = "    \t\t\t我的天哪\n         "
# # 剔除掉左右两端的 '空白符'
# # \t  制表符. 一个缩进
# # \r  回车
# # \n  换行
# # print(s)
# # print(s.strip())  # 记住了
#
# # 字符串的操作：所有的字符串是不可变的数据类型。
# # 所有的字符串操作。 都是返回一个新的字符串
# # 新的字符串符合你的要求的
#
# # 字符串操作一定要重新赋值。 否则看到的是无效的
# s = s.strip()
# # s.strip()  # 不好用  # 枪毙五分钟。
# print(s)
# # 7     9

# # 如果字符串中间有空白符， 如何去掉
# s = "alex是一个dsb, 我们\n都很喜\t欢他. 经常\n带我洗脚alex"
#
# # replace(原来的内容, 你要换上去的东西) 替换
# # print(s)
# # 下面这段话以后会经常遇到
# s = s.replace("\n", "").replace("\t", "").replace(" ", "")  # 干掉\n
# print(s)


# # 这俩东西没关系. 别记混了. 记混了枪毙
# # split() <-> strip()
# s = "alex_wusir_sylar_彭于晏_樵夫"
# lst = s.split('_')
# print(lst)

#
# lst = ["张无忌", "樵夫", "10086", "alex", "不可能"]
#
# # 可以用join把列表中的内容拼接起来
# # 张无忌樵夫10086alex不可能
# s = "".join(lst)  # 拼接 经常遇到
# print(s)


#  "周杰伦不认识我"
# lst2 = ["\n\r", "\n\r", "周杰伦\n\r", "\n不认识我\r"]
# s = "".join(lst2).replace("\n", "").replace("\r" ,"")  # "\n\r\n\r周杰伦\n\r\n不认识我\r"
# print(s)


# name = "alex"
# s = "%s昨天洗脚被抓了" % name
# s = "{}昨天洗脚被抓了".format(name)
# print(s)

# # f-string
# # s = f"{name}昨天洗{name}脚被{name}抓了"
# age = 10085
# s = f"我喜欢你{age + 1}"
# print(s)


# lst = ["王德法", "哈哈哈", "呵呵呵呵", "张无忌"]
# item = lst[0]
# print(item)

# s = lst[3][1]
# print(s)
# s = lst[1:3]   # 切片, 字符串的切片和列表的切片逻辑是一样的
# print(s)
# print(lst[1:])  # 过滤掉第一个


lst = ["赵本山"]
print(lst)

lst.append("范围")
print(lst)
lst.append("周润发")
print(lst)  # ['赵本山', '范围', '周润发']
lst.remove("赵本山")
print(lst)
